holographicSol/SatIO_ESP32-P4/SatIO/src/task_handler.cpp
    /** ----------------------------------------------------------------------------
      DATETIME
    */
    
    // satellit count
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, gnggaData.satellite_count);
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    n_bytes = (uint8_t)strlen(temp_buffer_multidisplay)+2;
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, n_bytes); // length
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x0B); // command 11
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, n_bytes, iic_delay, "updateSSD1306");

    // GPS precision
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, gnggaData.gps_precision_factor);
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    n_bytes = (uint8_t)strlen(temp_buffer_multidisplay)+2;
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, n_bytes); // length
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x0C); // command 12
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, n_bytes, iic_delay, "updateSSD1306");

    // time HHMMSS
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, satioData.formatted_local_time_HHMMSS);
    if (strlen(temp_buffer_multidisplay)==8) { 
      clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
      n_bytes = (uint8_t)strlen(temp_buffer_multidisplay)+2;
      write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, n_bytes); // length
      write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x0D); // command 13
      write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
      writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, n_bytes, iic_delay, "updateSSD1306");
    }
    
    // date DDMMYY
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, satioData.formatted_local_short_date_DDMMYY);
    if (strlen(temp_buffer_multidisplay)==8) { 
      clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
      n_bytes = (uint8_t)strlen(temp_buffer_multidisplay)+2;
      write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, n_bytes); // length
      write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x0E); // command 14
      write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
      writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, n_bytes, iic_delay, "updateSSD1306");
    }

    // RTC sync time HHMMSS
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, satioData.formatted_rtc_sync_time);
    if (strlen(temp_buffer_multidisplay)==8) { 
      clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
      n_bytes = (uint8_t)strlen(temp_buffer_multidisplay)+2;
      write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, n_bytes); // length
      write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x0F); // command 15
      write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
      writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, n_bytes, iic_delay, "updateSSD1306");
    }

    // RTC sync date DDMMYY
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, satioData.formatted_rtc_sync_short_date_DDMMYY);
    if (strlen(temp_buffer_multidisplay)==8) {
      clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
      n_bytes = (uint8_t)strlen(temp_buffer_multidisplay)+2;
      write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, n_bytes); // length
      write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x10); // command 16
      write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
      writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, n_bytes, iic_delay, "updateSSD1306");
    }

    /** ----------------------------------------------------------------------------
      ATTITUDE
    */

    // gyro angle x
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(gyroData.gyro_0_ang_x).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    n_bytes = (uint8_t)strlen(temp_buffer_multidisplay)+2;
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, n_bytes); // length
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x15); // command 21
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, n_bytes, iic_delay, "updateSSD1306");

    // gyro angle y
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(gyroData.gyro_0_ang_y).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    n_bytes = (uint8_t)strlen(temp_buffer_multidisplay)+2;
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, n_bytes); // length
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x16); // command 22
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, n_bytes, iic_delay, "updateSSD1306");

    // gyro angle z
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(gyroData.gyro_0_ang_z).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    n_bytes = (uint8_t)strlen(temp_buffer_multidisplay)+2;
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, n_bytes); // length
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x17); // command 23
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, n_bytes, iic_delay, "updateSSD1306");

    /** ----------------------------------------------------------------------------
      ACCELLERATION
    */

    // accel x
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(gyroData.gyro_0_acc_x).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    n_bytes = (uint8_t)strlen(temp_buffer_multidisplay)+2;
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, n_bytes); // length
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x1F); // command 31
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, n_bytes, iic_delay, "updateSSD1306");

