holographicSol/SatIO_ESP32-P4/SatIO/src/task_handler.cpp
    // accel y
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(gyroData.gyro_0_acc_y).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    n_bytes = (uint8_t)strlen(temp_buffer_multidisplay)+2;
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, n_bytes); // length
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x20); // command 32
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, n_bytes, iic_delay, "updateSSD1306");

    // accel z
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(gyroData.gyro_0_acc_z).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    n_bytes = (uint8_t)strlen(temp_buffer_multidisplay)+2;
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, n_bytes); // length
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x21); // command 33
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, n_bytes, iic_delay, "updateSSD1306");

    /** ----------------------------------------------------------------------------
      MAGNETIC FIELD
    */

    // mag x
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(gyroData.gyro_0_mag_x).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    n_bytes = (uint8_t)strlen(temp_buffer_multidisplay)+2;
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, n_bytes); // length
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x29); // command 41
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, n_bytes, iic_delay, "updateSSD1306");

    // mag y
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(gyroData.gyro_0_mag_y).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    n_bytes = (uint8_t)strlen(temp_buffer_multidisplay)+2;
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, n_bytes); // length
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x2A); // command 42
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, n_bytes, iic_delay, "updateSSD1306");

    // mag z
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(gyroData.gyro_0_mag_z).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    n_bytes = (uint8_t)strlen(temp_buffer_multidisplay)+2;
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, n_bytes); // length
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x2B); // command 43
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, n_bytes, iic_delay, "updateSSD1306");

    /** ----------------------------------------------------------------------------
      SPEED
    */
    
    // speed converted
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(satioData.speed_converted).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    n_bytes = (uint8_t)strlen(temp_buffer_multidisplay)+2;
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, n_bytes); // length
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x33); // command 51
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, n_bytes, iic_delay, "updateSSD1306");

    // speed measurement
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(satioData.char_speed_unit_mode[satioData.speed_unit_mode]).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    n_bytes = (uint8_t)strlen(temp_buffer_multidisplay)+2;
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, n_bytes); // length
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x34); // command 52
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, n_bytes, iic_delay, "updateSSD1306");

    /** ---------------------------------------------------------------------------
     * ALTITUDE
     */

    // altitude converted
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(satioData.altitude_converted).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    n_bytes = (uint8_t)strlen(temp_buffer_multidisplay)+2;
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, n_bytes); // length
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x3D); // command 61
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, n_bytes, iic_delay, "updateSSD1306");

    // altitude measurement
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(satioData.char_altitude_unit_mode[satioData.altitude_unit_mode]).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    n_bytes = (uint8_t)strlen(temp_buffer_multidisplay)+2;
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, n_bytes); // length
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x3E); // command 62
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, n_bytes, iic_delay, "updateSSD1306");

    /** ---------------------------------------------------------------------------
     * DEGREES LATITUDE & LONGITUDE
     */

    // degrees latitude
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(satioData.degrees_latitude, 7).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    n_bytes = (uint8_t)strlen(temp_buffer_multidisplay)+2;
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, n_bytes); // length
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x47); // command 71
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, n_bytes, iic_delay, "updateSSD1306");
    
    // degrees longitude
    memset(temp_buffer_multidisplay, 0, sizeof(temp_buffer_multidisplay));
    strcpy(temp_buffer_multidisplay, String(satioData.degrees_longitude, 7).c_str());
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    n_bytes = (uint8_t)strlen(temp_buffer_multidisplay)+2;
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, n_bytes); // length
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x48); // command 72
    write_nchars_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, temp_buffer_multidisplay, strlen(temp_buffer_multidisplay));
    writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, n_bytes, iic_delay, "updateSSD1306");

    /** ----------------------------------------------------------------------------
      DRAW CANVAS(S)
    */

    // draw canvas
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, (uint8_t)3); // n bytes
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x0A); // command 10
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, 0);
    writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 3, iic_delay, "drawSSD1306Canvas");

    // draw canvas
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, (uint8_t)3); // n bytes
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x0A); // command 10
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, 1);
    writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 3, iic_delay, "drawSSD1306Canvas");

    // draw canvas
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, (uint8_t)3); // n bytes
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x0A ); // command 10
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, 2);
    writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 3, iic_delay, "drawSSD1306Canvas");

    // draw canvas
    clearI2CLinkOutputPacket(IICLinkMultiDisplayController);
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 0, (uint8_t)3); // n bytes
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 1, 0x0A ); // command 10
    write_uint8_ToPacket(IICLinkMultiDisplayController.OUTPUT_PACKET, 2, 3);
    writeI2CToSlaveBin(iic_2, IICLinkMultiDisplayController, I2C_MULTIDISPLAY_CONTROLLER_ADDRESS_0, 3, iic_delay, "drawSSD1306Canvas");
     

    /** ----------------------------------------------------------------------------
     * Display 4: Fast input (analog/digital multiplexer)
    */
   
    // multiplexer channel 0

